const RegExp = {
  regEmail: /^(([^<>()\[\]\\.,;:\s@”]+(\.[^<>()\[\]\\.,;:\s@”]+)*)|(“.+”))@((\[[0–9]{1,3}\.[0–9]{1,3}\.[0–9]{1,3}\.[0–9]{1,3}])|(([a-zA-Z\-0–9]+\.)+[a-zA-Z]{2,}))$/,
  regLetters: /^[A-ZÁÉÍÓÚÑ ]+$/i,
  regPhone: /^(?:(?:\(?(?:00|\+)([1-4]\d\d|[1-9]\d?)\)?)?[\-\.\ \\\/]?)?((?:\(?\d{1,}\)?[\-\.\ \\\/]?){0,})(?:[\-\.\ \\\/]?(?:#|ext\.?|extension|x)[\-\.\ \\\/]?(\d+))?$/i,
  regPassword: /^[\w-\/]{8,15}$/i,
  regName:  /^[\p{L}ñÑáéíóúÁÉÍÓÚüÜ\p{S}]{4,}( [\p{L}ñÑáéíóúÁÉÍÓÚüÜ\p{S}]{1,})?$/u,
  regLastName: /^[\p{L}ñÑáéíóúÁÉÍÓÚüÜ\p{S}]{4,}( [\p{L}ñÑáéíóúÁÉÍÓÚüÜ\p{S}]{1,})?$/u,
  regUsername: /^(?=.*[a-zA-Z])[\w_]{4,}$/,
  regBirthday: /^(0?[1-9]|[12][0-9]|3[01])[\/](0?[1-9]|1[012])[\/](19|20)\d\d$/
}

export default RegExp